---
title: RuledFace
classe: Autodesk.Revit.DB.RuledFace
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.Face
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# RuledFace

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Curve Curve { get; }` | `ruledFace.Curve` | Curve |
| `Boolean IsExtruded { get; }` | `ruledFace.IsExtruded` | Boolean |
| `XYZ Point { get; }` | `ruledFace.Point` | XYZ |
| `Boolean RulingsAreParallel { get; }` | `ruledFace.RulingsAreParallel` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```